Autodesk.Revit.DB.Structure.RebarSpliceByRulesError.TooBigCrank
The crank lengths exceed the maximum length.

Autodesk.Revit.DB.Structure.RebarSpliceByRulesError.InvalidRebar
Free Form rebars, or Shape Driven rebars that are Multiplanar, or have a shape whose definition is RebarShapeDefinitionByArc, or rebars that are part of a group can't be spliced.